driver-tests/httpsoapbc/HttpSoapBCTests/HttpSoapBCJbi/test/StringFaultDetailResponse/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pur="urn:BpelFaults/StringFaultDetailResponse/POService">
  <soapenv:Body>
    <pur:sendPurchaseOrder>
      <purchaseOrder>
        <purchaseOrder>
          <orderId>1234</orderId>
	    <customerId>9876</customerId>
	    <orderDescription>ThrowPOServiceFault_Val_Any_Description</orderDescription>
	    <price></price>
	    <orderDate></orderDate>
        </purchaseOrder>
      </purchaseOrder>
    </pur:sendPurchaseOrder>
  </soapenv:Body>
</soapenv:Envelope>